// Rule: Brute Force Login Attack Detection
// MITRE: T1110 - Credential Access
// Severity: High
// Threshold: 5 failed logins per user in 5 minutes
// SigniLogs are been used here 

SigninLogs
| where TimeGenerated >= ago(5m)
| where ResultType != "0"
| summarize
    FailedAttempts = count(),
    SourceIPs = make_set(IPAddress),
    FirstSeen = min(TimeGenerated),
    LastSeen = max(TimeGenerated)
    by UserPrincipalName, bin(TimeGenerated, 5m)
| where FailedAttempts >= 5
| extend
    AlertSeverity = "High",
    MITRETactic = "TA0006 - Credential Access",
    MITRETechnique = "T1110 - Brute Force"
| project
    TimeGenerated,
    UserPrincipalName,
    FailedAttempts,
    SourceIPs,
    FirstSeen,
    LastSeen,
    AlertSeverity,
    MITRETactic,
    MITRETechnique

