// Rule: Privilege Escalation - Admin Role Assigned
// MITRE: T1078 - Valid Accounts
// Severity: High
// Trigger: Single event - immediate fire
//AzureActivity based logs are been created and used 

AzureActivity
| where TimeGenerated >= ago(1h)
| where OperationName == "Microsoft.Authorization/roleAssignments/write"
| where ActivityStatus == "Succeeded"
| extend
    AlertSeverity = "High",
    MITRETactic = "TA0004 - Privilege Escalation",
    MITRETechnique = "T1078 - Valid Accounts"
| project
    TimeGenerated,
    Caller,
    ResourceGroup,
    OperationName,
    ActivityStatus,
    AlertSeverity,
    MITRETactic,
    MITRETechnique

